import React, {PureComponent} from "react";
import ReactModal from 'react-modal';
import PropTypes from "prop-types";


ReactModal.setAppElement('.site-container');

class PolicyWindow extends PureComponent {
  constructor(props) {
    super(props);
  }


  render() {
    const {openState, onCloweModalWindow} = this.props;

    return (
      <React.Fragment>
        <ReactModal
          isOpen={openState}
          contentLabel={`Политика конфиденциальности`}
          onRequestClose={onCloweModalWindow}
          className="policy-window__wrapper"
          overlayClassName="policy-window__overlay"
        >

          <div className="policy-window__text">
            <h3 className="policy-window__header">Политика конфиденциальности</h3>
            <p className="policy-window__text-data">Настоящая Политика конфиденциальности приложения «Шеф Здесь» (далее — Политика) действует в отношении всей информации, которую ООО «Корпорация Джей Эс» может получить о пользователе во время использования им данного приложения. Использование приложения означает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации, в случае несогласия с этими условиями пользователь должен воздержаться от использования приложения.</p>

            <h3 className="policy-window__header">1. Персональная информация пользователей, которую получает и обрабатывает приложение «Шеф Здесь»</h3>
            <p className="policy-window__text-data">1.1. В рамках настоящей Политики под «персональной информацией пользователя» понимаются:</p>
            <p className="policy-window__text-data">1.1.1. Персональная информация, которую пользователь предоставляет о себе самостоятельно при регистрации (создании учётной записи) или в процессе использования приложения, включая персональные данные пользователя:</p>
            <ul className="policy-window__list">
              <li className="policy-window__list-item">Имя;</li>
              <li className="policy-window__list-item">Номер мобильного телефона (используется для связи с пользователем);</li>
              <li className="policy-window__list-item">Адрес (используется для оказания предоставляемых услуг).</li>
            </ul>
            <p className="policy-window__text-data">1.1.2 Данные, которые автоматически передаются в ООО «Корпорация Джей Эс» в процессе их использования с помощью, установленного на устройстве приложения, в том числе информация из cookie, информация об устройстве пользователя:</p>
            <p className="policy-window__text-data">Идентификатор мобильного устройства.</p>
            <p className="policy-window__text-data">1.2. Настоящая Политика применима только к приложению  «Шеф Здесь» ООО «Корпорация Джей Эс».</p>
            <p className="policy-window__text-data">1.3. ООО «Корпорация Джей Эс» в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако ООО «Корпорация Джей Эс» исходит из того, что информация, переданная им от пользователей, является достоверной и поддерживает эту информацию в актуальном состоянии.</p>

            <h3 className="policy-window__header">2. Цели сбора и обработки персональной информации пользователей</h3>
            <p className="policy-window__text-data">2.1. Приложение собирает и хранит только те персональные данные, которые необходимы для предоставления сервисов, входящих в состав приложения.</p>
            <p className="policy-window__text-data">2.2. Персональную информацию пользователя приложения ООО «Корпорация Джей Эс»  может использовать в следующих целях:</p>
            <p className="policy-window__text-data">2.2.1. Идентификация стороны в рамках соглашений;</p>
            <p className="policy-window__text-data">2.2.2. Предоставление пользователю персонализированных сервисов;</p>
            <p className="policy-window__text-data">2.2.3. Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;</p>
            <p className="policy-window__text-data">2.2.4. Улучшение качества приложения, удобства его использования, разработка новых сервисов и услуг;</p>
            <p className="policy-window__text-data">2.2.5. Проведение статистических и иных исследований на основе обезличенных данных.</p>

            <h3 className="policy-window__header">3. Условия обработки персональной информации пользователя и её передачи третьим лицам</h3>
            <p className="policy-window__text-data">3.1. Приложение хранит персональную информацию пользователей в защищенном сегменте на сервере в России.</p>
            <p className="policy-window__text-data">3.2. В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц.</p>
            <p className="policy-window__text-data">3.3. ООО «Корпорация Джей Эс»  вправе передать персональную информацию пользователя третьим лицам в следующих случаях:</p>
            <p className="policy-window__text-data">3.3.1. Передача необходима в рамках использования пользователем определенного сервиса либо для оказания услуги пользователю;</p>
            <p className="policy-window__text-data">3.4. При обработке персональных данных пользователей приложения ООО «Корпорация Джей Эс» руководствуется Федеральным законом РФ «О персональных данных».</p>

            <h3 className="policy-window__header">4. Меры, применяемые для защиты персональной информации пользователей</h3>
            <p className="policy-window__text-data">ООО «Корпорация Джей Эс» принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>

            <h3 className="policy-window__header">5. Изменение Политики конфиденциальности. Применимое законодательство</h3>
            <p className="policy-window__text-data">5.1. ООО «Корпорация Джей Эс» имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее подписания, если иное не предусмотрено новой редакцией Политики.</p>
            <p className="policy-window__text-data">5.2. К настоящей Политике и отношениям между пользователем и ООО «Корпорация Джей Эс», возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.</p>

            <h3 className="policy-window__header">6. Обратная связь. Вопросы и предложения</h3>
            <p className="policy-window__text-data">Все предложения или вопросы по поводу настоящей Политики следует сообщать в Службу поддержки пользователей ООО «Корпорация Джей Эс» по почте office@jscorp.ru. Настоящая редакция политики конфиденциальности опубликована 14 апреля 2019 года.</p>

          </div>
          <button className="policy-window__button" onClick={onCloweModalWindow}>Хорошо</button>

        </ReactModal>
      </React.Fragment>
    );
  }
};


PolicyWindow.propTypes = {
  openState: PropTypes.bool.isRequired,
  onCloweModalWindow: PropTypes.func.isRequired,
};


export default PolicyWindow;
