import React, {PureComponent} from "react";
import ReactModal from 'react-modal';
import PropTypes from "prop-types";

import {PoliticsTexts} from "../../../const.js";


ReactModal.setAppElement('.site-container');

class PolicyWindow extends PureComponent {
  constructor(props) {
    super(props);

    this._renderCookies = this._renderCookies.bind(this);
    this._renderPolitic = this._renderPolitic.bind(this);
    this._renderPolicy = this._renderPolicy.bind(this);
    this._renderOfer = this._renderOfer.bind(this);
  }

  _renderCookies() {
    return (
      <div className="policy-window__text">
        <h3 className="policy-window__header">Что такое файлы cookie?</h3>
        <p className="policy-window__text-data">Файлы cookie представляют собой небольшие текстовые файлы, которые сохраняются на вашем устройстве при посещении веб-сайта. Затем файлы cookie пересылаются обратно на исходный веб-сайт при каждом последующем посещении или на другой сайт, который распознает этот файл cookie. Файлы cookie используются для обеспечения или повышения эффективности работы веб-сайта, а также для предоставления информации его владельцам. Собираемая информация используется для повышения клиентоориентированности и персонализации использования веб-сайта. Мы можем использовать как файлы cookie первой стороны, устанавливаемые непосредственно нами, так и файлы cookie третьей стороны, устанавливаемые сторонним провайдером от нашего имени. Каждый раз, когда вы используете настоящий веб-сайт, он может собирать информацию с помощью файлов cookie и других подобных технологий (например, веб-маяков, тегов, скриптов или локального хранилища). </p>

        <h3 className="policy-window__header">Какие файлы cookie мы используем и почему</h3>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">Строго необходимые файлы cookie — требуются для функционирования веб-сайта и не могут быть отключены в наших системах. Как правило, они устанавливаются только в ответ на ваши действия, такие как настройка уровня конфиденциальности, вход в систему или заполнение форм.</li>
          <li className="policy-window__list-item">Аналитические и эксплуатационные файлы cookie — позволяют нам подсчитывать количество посетителей и источники трафика, чтобы оценивать и улучшать работу нашего веб-сайта. Они могут устанавливаться нами или сторонними поставщиками (например, Adobe, Akamai, Brightcove, Qualtrics) и собирают информацию о том, как посетители используют веб-сайт и какие страницы или видеоролики посещают чаще всего.</li>
          <li className="policy-window__list-item">Функциональные файлы cookie — позволяют веб-сайту предоставлять расширенные или более персонализированные функции, основываясь на истории вашего взаимодействия с ним. Они могут устанавливаться нами или сторонними поставщиками (например, Adobe), услуги которых мы добавили на страницы нашего веб-сайта.</li>
          <li className="policy-window__list-item">Целевые и рекламные файлы cookie — могут устанавливать на сайте наши партнеры по рекламе, например, Adobe. Такие компании могут использовать их для создания профиля ваших интересов и показа соответствующих рекламных объявлений на других веб-сайтах.</li>
          <li className="policy-window__list-item">Файлы cookie социальных сетей — устанавливаются службами социальных сетей (например, Twitter, LinkedIn, Facebook), которые мы добавили на наш веб-сайт и которые позволяют вам делиться нашим контентом со своими друзьями и другими пользователями. Они могут отслеживать ваши действия.</li>
          <li className="policy-window__list-item">на других сайтах и создавать профиль ваших интересов. Это может повлиять на содержимое других веб-сайтов, которые вы посещаете, и сообщения, которые вы видите на них.</li>
        </ul>

        <p className="policy-window__text-data">Для просмотра списка файлов cookie, используемых веб-сайтом, нажмите на «Управление предпочтениями по использованию файлов cookie» в верхней части настоящего «Уведомления об использовании файлов cookie».</p>

      </div>
    );
  }

  _renderPolitic() {
    return (
      <div className="policy-window__text">
        <h3 className="policy-window__header">Пользовательское Соглашение</h3>
        <p className="policy-window__text-data">Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ООО «Корпорация Джей Эс» (далее «Шеф здесь» или Администрация) с одной стороны и пользователем приложения с другой. Приложение «Шеф здесь» не является средством массовой информации.</p>

        <p className="policy-window__text-data">Используя приложение, Вы соглашаетесь с условиями данного соглашения.</p>
        <p className="policy-window__text-data">Если Вы не согласны с условиями данного соглашения, не используйте приложение «Шеф здесь»!</p>

        <h3 className="policy-window__header">Права и обязанности сторон</h3>
        <p className="policy-window__text-data">Пользователь имеет право:</p>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">осуществлять поиск информации в приложении</li>
          <li className="policy-window__list-item">получать информацию в приложении</li>
          <li className="policy-window__list-item">использовать информацию приложения в личных некоммерческих целях</li>
        </ul>

        <h3 className="policy-window__header">Администрация имеет право:</h3>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
          <li className="policy-window__list-item">ограничивать доступ к любой информации в приложении</li>
        </ul>

        <h3 className="policy-window__header">Пользователь обязуется:</h3>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">обеспечить достоверность предоставляемой информации</li>
          <li className="policy-window__list-item">обеспечивать сохранность личных данных от доступа третьих лиц</li>
          <li className="policy-window__list-item">не нарушать работоспособность приложения</li>
          <li className="policy-window__list-item">не совершать действия, направленные на введение других Пользователей в заблуждение</li>
          <li className="policy-window__list-item">не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
          <li className="policy-window__list-item">не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</li>
          <li className="policy-window__list-item">не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с приложением и его Сервисами</li>
        </ul>

        <h3 className="policy-window__header">Администрация обязуется:</h3>
        <p>поддерживать работоспособность приложения  за исключением случаев, когда это невозможно по независящим от Администрации причинам.</p>

        <h3 className="policy-window__header">Ответственность сторон</h3>
        <p className="policy-window__text-data">в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу  приложения.</p>

        <h3 className="policy-window__header">Условия действия Соглашения</h3>
        <p className="policy-window__text-data">Данное Соглашение вступает в силу при любом использовании данного приложения.</p>
        <p className="policy-window__text-data">Соглашение перестает действовать при появлении его новой версии.</p>
        <p className="policy-window__text-data">Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</p>
        <p className="policy-window__text-data">При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.</p>
      </div>
    );
  }

  _renderPolicy() {
    return(
      <div className="policy-window__text">
        <h3 className="policy-window__header">Политика конфиденциальности</h3>
        <p className="policy-window__text-data">Настоящая Политика конфиденциальности приложения «Шеф Здесь» (далее — Политика) действует в отношении всей информации, которую ООО «Корпорация Джей Эс» может получить о пользователе во время использования им данного приложения. Использование приложения означает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации, в случае несогласия с этими условиями пользователь должен воздержаться от использования приложения.</p>

        <h3 className="policy-window__header">1. Персональная информация пользователей, которую получает и обрабатывает приложение «Шеф Здесь»</h3>
        <p className="policy-window__text-data">1.1. В рамках настоящей Политики под «персональной информацией пользователя» понимаются:</p>
        <p className="policy-window__text-data">1.1.1. Персональная информация, которую пользователь предоставляет о себе самостоятельно при регистрации (создании учётной записи) или в процессе использования приложения, включая персональные данные пользователя:</p>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">Имя;</li>
          <li className="policy-window__list-item">Номер мобильного телефона (используется для связи с пользователем);</li>
          <li className="policy-window__list-item">Адрес (используется для оказания предоставляемых услуг).</li>
        </ul>
        <p className="policy-window__text-data">1.1.2 Данные, которые автоматически передаются в ООО «Корпорация Джей Эс» в процессе их использования с помощью, установленного на устройстве приложения, в том числе информация из cookie, информация об устройстве пользователя:</p>
        <p className="policy-window__text-data">Идентификатор мобильного устройства.</p>
        <p className="policy-window__text-data">1.2. Настоящая Политика применима только к приложению  «Шеф Здесь» ООО «Корпорация Джей Эс».</p>
        <p className="policy-window__text-data">1.3. ООО «Корпорация Джей Эс» в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако ООО «Корпорация Джей Эс» исходит из того, что информация, переданная им от пользователей, является достоверной и поддерживает эту информацию в актуальном состоянии.</p>

        <h3 className="policy-window__header">2. Цели сбора и обработки персональной информации пользователей</h3>
        <p className="policy-window__text-data">2.1. Приложение собирает и хранит только те персональные данные, которые необходимы для предоставления сервисов, входящих в состав приложения.</p>
        <p className="policy-window__text-data">2.2. Персональную информацию пользователя приложения ООО «Корпорация Джей Эс»  может использовать в следующих целях:</p>
        <p className="policy-window__text-data">2.2.1. Идентификация стороны в рамках соглашений;</p>
        <p className="policy-window__text-data">2.2.2. Предоставление пользователю персонализированных сервисов;</p>
        <p className="policy-window__text-data">2.2.3. Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;</p>
        <p className="policy-window__text-data">2.2.4. Улучшение качества приложения, удобства его использования, разработка новых сервисов и услуг;</p>
        <p className="policy-window__text-data">2.2.5. Проведение статистических и иных исследований на основе обезличенных данных.</p>

        <h3 className="policy-window__header">3. Условия обработки персональной информации пользователя и её передачи третьим лицам</h3>
        <p className="policy-window__text-data">3.1. Приложение хранит персональную информацию пользователей в защищенном сегменте на сервере в России.</p>
        <p className="policy-window__text-data">3.2. В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц.</p>
        <p className="policy-window__text-data">3.3. ООО «Корпорация Джей Эс»  вправе передать персональную информацию пользователя третьим лицам в следующих случаях:</p>
        <p className="policy-window__text-data">3.3.1. Передача необходима в рамках использования пользователем определенного сервиса либо для оказания услуги пользователю;</p>
        <p className="policy-window__text-data">3.4. При обработке персональных данных пользователей приложения ООО «Корпорация Джей Эс» руководствуется Федеральным законом РФ «О персональных данных».</p>

        <h3 className="policy-window__header">4. Меры, применяемые для защиты персональной информации пользователей</h3>
        <p className="policy-window__text-data">ООО «Корпорация Джей Эс» принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>

        <h3 className="policy-window__header">5. Изменение Политики конфиденциальности. Применимое законодательство</h3>
        <p className="policy-window__text-data">5.1. ООО «Корпорация Джей Эс» имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее подписания, если иное не предусмотрено новой редакцией Политики.</p>
        <p className="policy-window__text-data">5.2. К настоящей Политике и отношениям между пользователем и ООО «Корпорация Джей Эс», возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.</p>

        <h3 className="policy-window__header">6. Обратная связь. Вопросы и предложения</h3>
        <p className="policy-window__text-data">Все предложения или вопросы по поводу настоящей Политики следует сообщать в Службу поддержки пользователей ООО «Корпорация Джей Эс» по почте office@jscorp.ru. Настоящая редакция политики конфиденциальности опубликована 14 апреля 2019 года.</p>

      </div>
    );
  }

  _renderOfer() {
    return(
      <div className="policy-window__text">
        <h3 className="policy-window__header">Оферта</h3>
        <p className="policy-window__text-data">Настоящая оферта приложения «Шеф Здесь» (далее — Политика) действует в отношении всей информации, которую ООО «Корпорация Джей Эс» может получить о пользователе во время использования им данного приложения. Использование приложения означает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации, в случае несогласия с этими условиями пользователь должен воздержаться от использования приложения.</p>

        <h3 className="policy-window__header">1. Персональная информация пользователей, которую получает и обрабатывает приложение «Шеф Здесь»</h3>
        <p className="policy-window__text-data">1.1. В рамках настоящей Политики под «персональной информацией пользователя» понимаются:</p>
        <p className="policy-window__text-data">1.1.1. Персональная информация, которую пользователь предоставляет о себе самостоятельно при регистрации (создании учётной записи) или в процессе использования приложения, включая персональные данные пользователя:</p>
        <ul className="policy-window__list">
          <li className="policy-window__list-item">Имя;</li>
          <li className="policy-window__list-item">Номер мобильного телефона (используется для связи с пользователем);</li>
          <li className="policy-window__list-item">Адрес (используется для оказания предоставляемых услуг).</li>
        </ul>
        <p className="policy-window__text-data">1.1.2 Данные, которые автоматически передаются в ООО «Корпорация Джей Эс» в процессе их использования с помощью, установленного на устройстве приложения, в том числе информация из cookie, информация об устройстве пользователя:</p>
        <p className="policy-window__text-data">Идентификатор мобильного устройства.</p>
        <p className="policy-window__text-data">1.2. Настоящая Политика применима только к приложению  «Шеф Здесь» ООО «Корпорация Джей Эс».</p>
        <p className="policy-window__text-data">1.3. ООО «Корпорация Джей Эс» в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако ООО «Корпорация Джей Эс» исходит из того, что информация, переданная им от пользователей, является достоверной и поддерживает эту информацию в актуальном состоянии.</p>

        <h3 className="policy-window__header">2. Цели сбора и обработки персональной информации пользователей</h3>
        <p className="policy-window__text-data">2.1. Приложение собирает и хранит только те персональные данные, которые необходимы для предоставления сервисов, входящих в состав приложения.</p>
        <p className="policy-window__text-data">2.2. Персональную информацию пользователя приложения ООО «Корпорация Джей Эс»  может использовать в следующих целях:</p>
        <p className="policy-window__text-data">2.2.1. Идентификация стороны в рамках соглашений;</p>
        <p className="policy-window__text-data">2.2.2. Предоставление пользователю персонализированных сервисов;</p>
        <p className="policy-window__text-data">2.2.3. Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;</p>
        <p className="policy-window__text-data">2.2.4. Улучшение качества приложения, удобства его использования, разработка новых сервисов и услуг;</p>
        <p className="policy-window__text-data">2.2.5. Проведение статистических и иных исследований на основе обезличенных данных.</p>

        <h3 className="policy-window__header">3. Условия обработки персональной информации пользователя и её передачи третьим лицам</h3>
        <p className="policy-window__text-data">3.1. Приложение хранит персональную информацию пользователей в защищенном сегменте на сервере в России.</p>
        <p className="policy-window__text-data">3.2. В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц.</p>
        <p className="policy-window__text-data">3.3. ООО «Корпорация Джей Эс»  вправе передать персональную информацию пользователя третьим лицам в следующих случаях:</p>
        <p className="policy-window__text-data">3.3.1. Передача необходима в рамках использования пользователем определенного сервиса либо для оказания услуги пользователю;</p>
        <p className="policy-window__text-data">3.4. При обработке персональных данных пользователей приложения ООО «Корпорация Джей Эс» руководствуется Федеральным законом РФ «О персональных данных».</p>

        <h3 className="policy-window__header">4. Меры, применяемые для защиты персональной информации пользователей</h3>
        <p className="policy-window__text-data">ООО «Корпорация Джей Эс» принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</p>

        <h3 className="policy-window__header">5. Изменение Политики конфиденциальности. Применимое законодательство</h3>
        <p className="policy-window__text-data">5.1. ООО «Корпорация Джей Эс» имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее подписания, если иное не предусмотрено новой редакцией Политики.</p>
        <p className="policy-window__text-data">5.2. К настоящей Политике и отношениям между пользователем и ООО «Корпорация Джей Эс», возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.</p>

        <h3 className="policy-window__header">6. Обратная связь. Вопросы и предложения</h3>
        <p className="policy-window__text-data">Все предложения или вопросы по поводу настоящей Политики следует сообщать в Службу поддержки пользователей ООО «Корпорация Джей Эс» по почте office@jscorp.ru. Настоящая редакция политики конфиденциальности опубликована 14 апреля 2019 года.</p>

      </div>
    );
  }


  render() {
    const {openState, onCloweModalWindow} = this.props;
    return (
      <React.Fragment>
        <ReactModal
          isOpen={openState > 0}
          contentLabel={`Политика конфиденциальности`}
          onRequestClose={onCloweModalWindow}
          className="policy-window__wrapper"
          overlayClassName="policy-window__overlay"
        >
          {openState === PoliticsTexts.PRIVACY_POLICY ? this._renderPolicy() :
              openState === PoliticsTexts.USE_POLICY ? this._renderPolitic() :
              openState === PoliticsTexts.OFER_POLICY ? this._renderOfer() :
              openState === PoliticsTexts.COOKIES ? this._renderCookies() : ``}

          <button className="policy-window__button" onClick={onCloweModalWindow}>Хорошо</button>

        </ReactModal>
      </React.Fragment>
    );
  }
};


PolicyWindow.propTypes = {
  openState: PropTypes.number.isRequired,
  onCloweModalWindow: PropTypes.func.isRequired,
};


export default PolicyWindow;
